[
  {
    "text": "**LEARNING DILIGENCE**\n\nGod's word assures that a man who is diligent in his work will stand before kings and not mere men. This diligence can be learnt and cultivated through wisdom from God's word.\n\nIn this audio, \"Learning Diligence,\" Pastor Tara expounds on speed and time as two key aspects of mastery for diligence in academic and professional pursuits.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/656",
    "audios": [
      "https://t.me/TheSupernaturalStudent/655"
    ]
  },
  {
    "text": "**DEALING WITH ACADEMIC FAILURE\n**\nThe identity of the believer is rooted in Christ and not in past failures. This means that we can experience all-around victory in all our endeavors. \n\nIn this message, **\"Dealing with Academic Failure,\"** Pastor Tara emphasizes four practical ways to deal with academic failure. Through prophetic breath, he imparts the spirit of faith for possibilities and great success.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/642",
    "audios": [
      "https://t.me/TheSupernaturalStudent/641"
    ]
  },
  {
    "text": "**Excelling by the Forces of the Spirit**\n\nThe spirit of excellence distinguishes a man for exploits in all endeavors. This happens through God's favour, mercy and miracle-working power.\n\nIn this message, “Excelling by the Forces of the Spirit”, Pastor Tara Akinkuade reveals three powerful forces that we need to manifest excellence in our destinies and all endeavors.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/640",
    "audios": [
      "https://t.me/TheSupernaturalStudent/639"
    ]
  },
  {
    "text": "**IMPARTATION**\n\nImpartation is God’s way of preserving the anointing He bestows upon chosen men from one generation to another. It is the divine process through which God replicates and safeguards His investment on the earth, making it stronger as it goes from one generation to another. \n\nIn this messsage, God's Servant releases prophetic breath for supernatural advancement in destiny.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/634",
    "audios": [
      "https://t.me/TheSupernaturalStudent/633"
    ]
  },
  {
    "text": "**The Destiny Power of Righteousness**\n\nRighteousness is God’s free gift to everyone who receives the Lordship of Jesus Christ. It is what grants us the ability to stand before God without the feeling of guilt, inferiority or fear. This righteousness is what empowers us to fulfil our destinies.\n\nIn this message, “The Destiny Power of Righteousness”, Pastor Tara Akinkuade reveals the power of righteousness in enabling us to fulfil God’s plans for us maximally. He shows us how the understanding of our right standing with God imparts peace, calls forth our purpose, and leads us to prosperity.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/588",
    "audios": [
      "https://t.me/TheSupernaturalStudent/587"
    ]
  },
  {
    "text": "THE STAIRWAYS OF SIGNIFICANCE\n\nGod does not require a long time to change our lives and make us significant. However, how quickly we see God’s interventions in our lives as His children, and record greater manifestations of His promises to us is dependent on how quickly we accommodate what He  wants to do in our lives. \n\nIn this message, “Stairways of Significance”, Pastor Tara Akinkuade reveals how to ascend the stairway of significance by discovering and pursuing our God-ordained purpose, developing competence and character in what we do, and deploying the power of God.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/586",
    "audios": [
      "https://t.me/TheSupernaturalStudent/585"
    ]
  },
  {
    "text": "**FAITH TO CONQUER LIONS**\n\nVictories and great conquests are present realities for a believer, irrespective of seemingly difficult situations and menacing challenges.\n\nThe resurrection power of Christ at work in a believer is an empowerment tool for victory in all endeavors.\n\nIn this message, “Faith to Conquer Lions”, Pastor Tara Akinkuade draws principles from the lives of four biblical characters, highlighting the challenges that confront believers and how we can conquer them today.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/575",
    "audios": [
      "https://t.me/TheSupernaturalStudent/574"
    ]
  },
  {
    "text": "EXCELLING BY THE GIFTS OF THE SPIRIT\n\nGod has given us manifestations of the spirits to help us profit in every endeavour we embark on in life, including our academics. \n\nIn this message, Excelling by the Gifts of the Spirit, Pastor Tara reveals how to maximize the gifts to experience effortless success.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/573",
    "audios": [
      "https://t.me/TheSupernaturalStudent/572"
    ]
  },
  {
    "text": "**CONQUERING SPEAKING IN TOUGH ACADEMIC ENVIRONMENTS**\n\nGod has promised to give us a mouth and wisdom which no one will be able to resist. \n\nAt points of presentation or defence, this wisdom from God will enable us present irresistible answers.\n\nIn this message,  \"Conquering Speaking in Tough Academic Environments,\" Pastor Tara reveals practical steps to help us speak with power and wisdom in any professional or academic endeavour.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/566",
    "audios": [
      "https://t.me/TheSupernaturalStudent/565"
    ]
  },
  {
    "text": "**THE SECRET OF RETENTIVE ABILITY**\n\nThere is a skill from God's word to retain things. This retentive ability is one that enables a man to assimilate volumes of information in every area of study, and reproduce them at presentation points.\n\nIn this message, \"The Secret of Retentive Abililty\", Pastor Tara Akinkuade expounds on two major components of retention relevant in all professional and academic pursuits.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/547",
    "audios": [
      "https://t.me/TheSupernaturalStudent/546"
    ]
  },
  {
    "text": "**IT IS EASIER AT THE TOP\n\n**Academic exploits are easier at advanced levels. The Spirit of Excellence makes makes exploits at every academic level possible, and with greater ease. \n\nAn encounter with this Spirit of Excellence enlarges our capacity and increase our tenacity to solve problems.\n\nIn this message, \"It is Easier at the Top\", Pastor Tara Akinkuade reveals three key factors which are instrumental in birthing easy exploits in all professional and academic endeavors.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/545",
    "audios": [
      "https://t.me/TheSupernaturalStudent/544"
    ]
  },
  {
    "text": "OUTPERFORMING YOUR  INSTRUCTORS\n\nThere is a logical way that teachers and instructors understand the subjects they teach. \n\nBy the Spirit of God, a believer can access divine pathways to intrinsically understand any subject at the level of the originators and produce extraordinary results.\n\nIn this message, Outperforming your Instructors, Pastor Tara Akinkuade outlines three important things to maximise for exceptional results in your professional and academic endeavors.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/543",
    "audios": [
      "https://t.me/TheSupernaturalStudent/542"
    ]
  },
  {
    "text": "**SPECIAL QUESTION & ANSWER SESSION WITH PASTOR TARA**\n\nThe entrance of God's word brings light, and brings understanding to the simple.\n\nIn this Special Question & Answer Session, Pastor Tara Akinkuade shares insightful answers from God's word to plaguing questions arising from different professional and academic pursuits.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/529",
    "audios": [
      "https://t.me/TheSupernaturalStudent/528"
    ]
  },
  {
    "text": "The Creative Power of Prayers**\n\nOur prayers give God entrance into our affairs to provoke changes on our behalf. This is one of the major ways we vitally experience our victories in Christ.\n\nIn this message, “The Creative Power of Prayers”, Pastor Tara Akinkuade reveals that prayer is more than getting God's attention; it is about the release of power to cause changes in situations. He further outlines three products of prayer that unleash the creative power of God over our affairs.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/510",
    "audios": [
      "https://t.me/TheSupernaturalStudent/509"
    ]
  },
  {
    "text": "**Moving Your Generation Into God’s Purposes**\n\nMoving our generation into God’s purposes entails bringing God’s salvation to people, thereby liberating them from sin, bondage, poverty and sickness by the power of God. It also extends to instilling our generation with a steadfast commitment to walk in the ways of God.\n\nIn this message, “Moving Your Generation Into God’s Purposes” Pastor Tara Akinkuade reveals three things necessary for propelling our generation into alignment with God’s plans and purposes.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/498",
    "audios": [
      "https://t.me/TheSupernaturalStudent/497"
    ]
  },
  {
    "text": "Destiny Breakthroughs\n\nThe believer's life is designed for miraculous upliftments and relentless triumphs that enable him fulfil his divine assignment. These upliftments and triumphs -- which are destiny breakthroughs -- orchestrated by God through encounters and miracles, are pivotal moments that transform our destinies.\n\nIn this prophetic message 'Destiny Breakthroughs,' Pastor Tara Akinkuade expounds on the significance of breakthroughs in excellence, opportunities, finances, and healing for the realization of destiny. Through the release of God’s power, we are launched into these breakthroughs, setting us on course for destiny fulfilment.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/493",
    "audios": [
      "https://t.me/TheSupernaturalStudent/492"
    ]
  },
  {
    "text": "**Spiritual Intelligence For Great Success\n**\nGod desires that we prosper in all aspects of our lives and excel in all He has called us to undertake. However, if we would have great success in these endeavours, we require sound spiritual intelligence — a clear direction on supernatural practices to engage in per time.\n\nIn this message, “Spiritual Intelligence for Great Success”, Pastor Tara Akinkuade shows us how spiritual intelligence enables us to apply spiritual laws effectively for our success. He further reveals how we develop our spiritual intelligence through the study of God’s word, prayers and by surrounding ourselves with the right company.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/486",
    "audios": [
      "https://t.me/TheSupernaturalStudent/485"
    ]
  },
  {
    "text": "**Conquering New Academic Environments**\n\nIn every new academic environment that God takes us into, there is an expected end of victory for us. This transition to unfamiliar academic avenues can be enjoyed without fear of uncertainty or failure.\n\nIn this message “Conquering New Academic Environment,\" Pastor Tara Akinkuade reveals six practical strategies for thriving and conquering in any educational setting we find ourselves in.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/484",
    "audios": [
      "https://t.me/TheSupernaturalStudent/483"
    ]
  },
  {
    "text": "**Exploding Understanding**\n\nIn the pursuit of excellence in our professional and academic journeys, understanding stands as a paramount goal. God in his graciousness has therefore provided us with avenues to attain profound understanding through His word.\n\nIn this powerful sermon 'Exploding Understanding,' Pastor Tara Akinkuade shows us that by continuously feeding on God's Word we receive divine inspiration and enlightenment that transcends human comprehension, for great success in our endeavours.\n\nDownload. Listen. Share. Be Transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/482",
    "audios": [
      "https://t.me/TheSupernaturalStudent/481",
      "https://t.me/TheSupernaturalStudent/472"
    ]
  },
  {
    "text": "**ENGAGING THE SPIRIT OF EXCELLENCE**\n\nThe Spirit of Excellence always produces extraordinary results. A salient manifestation of the spirit of excellence as seen in God's word is going beyond limits to dissolve hard sentences and offer applicable solutions to hard problems. \n\nIn this prophetic message, The Senior Pastor shares principles on engaging the Spirit of Excellence and the fruits it brings. As you listen, be imparted to walk in the same grace and produce extraordinary results. \n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/450",
    "audios": [
      "https://t.me/TheSupernaturalStudent/449"
    ]
  },
  {
    "text": "**EXCEL**\n\nExcellent outcomes in any academic endeavor can be controlled spiritually. It is possible to record distinctions by believing God and engaging spiritual principles.\n\nIn this prophetic message, EXCEL, the Senior Pastor reveals the place of spirituality in excellence. He unravels God's divine wisdom which births outstanding excellence.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/447",
    "audios": [
      "https://t.me/TheSupernaturalStudent/446"
    ]
  },
  {
    "text": "IMPARTATION: ENLARGEMENT OF HEART\n\nIn every generation, God sends men as help to their generation. These men stand as portals so that anyone who encounters them gains speed in their divine destiny.\n\nIn this message from God-Encounters, the Senior Pastor expounds on how, by impartation, we receive acceleration in destiny through these men. By his words, he releases the fire of impartation to equip you to take command of the supernatural so that you can prosper in destiny and fulfil God’s purposes for you in every area of your life.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/313",
    "audios": [
      "https://t.me/TheSupernaturalStudent/312"
    ]
  },
  {
    "text": "THE EFFECTS OF RIGHTEOUSNESS\n\nOne of the greatest truths that a man can encounter is that of his righteousness in Christ. This righteousness is a free gift from God which brings victory over every sense of guilt, fear and inferiority.\n\nIn this message, The Effects of Righteousness, the Senior Pastor unveils effects of the believer's righteousness which bring about peace, purpose and prosperity.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/311",
    "audios": [
      "https://t.me/TheSupernaturalStudent/310"
    ]
  },
  {
    "text": "REALIGNMENT OF DESTINIES\n\nGod has a divine destiny for everyone. Yet, the fulfilment of it requires great strength and divine enablement. Many men  grow weak and experience disappointments and failures that cause them to falter on the paths God has ordained for them. The man who will fulfil destiny must therefore lay hold on it with skillfulness and divine encounters. \n\nIn this recent message, Realignment of Destinies, the Senior Pastor reveals how we can walk in God's pre-ordained plans for us and experience strength to carry out God's purposes on earth with grace. Receive prophetic utterances to birth encounters of destiny as you listen.  \n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/305",
    "audios": [
      "https://t.me/TheSupernaturalStudent/304"
    ]
  },
  {
    "text": "BIRTHING GREATNESS IN PRAYERS\n\nThe place of prayer is the place of greatness. Prayer gives birth to, and sustains great ideas and substantial projects. In the place of prayer, you birth God's purposes on earth and enforce your dominion in all spheres.\n\nIn this God-Encounters message, Birthing Greatness in Prayers, Pastor Tara  reveals 3 different things we can birth in the place of prayers to experience greatness.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/300",
    "audios": [
      "https://t.me/TheSupernaturalStudent/299"
    ]
  },
  {
    "text": "**DEALING WITH FORGETFULNESS \n**\nRemembrance is not abstract. It can be mastered as a result of training in God's word and instructions. God's word gives us instructions, which when followed can harness our remembrance.\n\nGod shows us things that help us create spiritual and physical measures around our lives so that we can experience remembrance continuously.\n\nIn this enlightening message, The Senior Pastor shares truths from God's word which will reprogramme your mind to have a new attitude to what you study and aid your remembrance.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/221",
    "audios": ["https://t.me/TheSupernaturalStudent/222"]
  },
  {
    "text": "**THE BLESSINGS OF EDUCATION 3**\n\nSharpening both spiritual and physical edges of your approach to life keeps you on the path of progress. You should pray, study God's word, and also develop yourself to the highest level in any sector you operate in.\n\nIn this final part of the message, 'The Blessings of Education', The Senior Pastor expounds on the importance of education in manifesting God's excellence in your business/career\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/203",
    "audios": [
      "https://t.me/TheSupernaturalStudent/202"
    ]
  },
  {
    "text": "THE BLESSING OF EDUCATION\n\nGod desires that you are the best in any educational endeavor you embark on.\n\nOne of the major pathways by which God brings you into places of greatness and influence is by your educational strides — in academic or professional settings.\n\nIn this message, The Blessing of Education, The Senior Pastor emphasizes the importance of excellence in education and the blessings that are available for you in education.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/197",
    "audios": [
      "https://t.me/TheSupernaturalStudent/196",
      "https://t.me/TheSupernaturalStudent/199"
    ]
  },
  {
    "text": "**SOLVING PRESENTATION SKILL PROBLEM FOR EXAMINATION SUCCESS**\n\nPresentation of answers is a major aspect of excellence in any endeavour.\n\nThe wisdom of God directs us at the spotlight of answer provision and question solving to produce excellent results.\n\nIn this message, \"Solving Presentation Skill Problem for Examination Success\", the Senior Pastor explains 5  things needed to solve presentation problems. \n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/178",
    "audios": [
      "https://t.me/TheSupernaturalStudent/177"
    ]
  },
  {
    "text": "**THE ANSWER OF PEACE**\n\nPresentation of answers is a major aspect of excellence in any endeavour.\n\nThe wisdom of God directs you at the spotlight of giving answers and solving questions to produce excellent results.\n\nIn this message, \"The Answer of Peace\", The Senior Pastor explains 3 practical ways to give answers of peace.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/168",
    "audios": [
      "https://t.me/TheSupernaturalStudent/167",
      "https://t.me/TheSupernaturalStudent/144"
    ]
  },
  {
    "text": "God has blessed you with everything you need to consistently produce distinctions and excellent results.\n\nThe consciousness of this blessing of God upon you causes you to engage in actions that lead to excellence in academics.\n\nIn this message, USING YOUR STONES, the Senior Pastor explains 3 things that can be maximized for academic exploits. \n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/110",
    "audios": ["https://t.me/TheSupernaturalStudent/109"]
  },
  {
    "text": "There is a level of consistency needed for dominance in academics. Discipline and diligence are required for this consistency.\n\nThe revelation of God's grace will help you maintain discipline needed for success.\n\nIn this message, \"Building Discipline for your Success\", you will be hearing the Senior Pastor explain 2 things which will help you live a disciplined life.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/103",
    "audios": [
      "https://t.me/TheSupernaturalStudent/102"
    ]
  },
  {
    "text": "God's promise for you is success in all your endeavours, and you should be conscious of this truth at all times. However, the enemy tries to implant thoughts of failure so as to make the fear of failure logical.\n\nIn the midst of fear, God's answer remains, \"FEAR NOT\"\n\nIn this message, \"DEFEATING THE FEAR OF FAILURE\", you will be hearing the Senior Pastor explain 4 things which are needed for the fear of failure to be defeated.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/96",
    "audios": ["https://t.me/TheSupernaturalStudent/95"]
  },
  {
    "text": "It is God that gives understanding, and this gift of understanding can be accessed. The word of God can transform a man's Intelligence Quotient (IQ), and reconfigure the brain to understand easily.\n\nIn this message, \"MORE UNDERSTANDING\", you will be hearing the Senior Pastor explain 3 core principles that will impart you with the grace to understand anything you read.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/92",
    "audios": [
      "https://t.me/TheSupernaturalStudent/91"
    ]
  },
  {
    "text": "Success is a result which can be commanded by giving heed to divine instructions. Through light from God's word, a man can experience this success consistently.\n\nIn this message, OUTRUNNING THE CHARIOTS OF THE BRILLIANT, you will be hearing the Senior Pastor explain 3 processes that will refine your mindset, and impart you with great confidence for success in any exams you face.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/86",
    "audios": [
      "https://t.me/TheSupernaturalStudent/85"
    ]
  },
  {
    "text": "Value is the currency for doing well where you are. Realizing your value is what gives strength to your purpose, and helps you receive from God.\n\nIn this message, YOU ARE VALUABLE, you will be hearing the Senior Pastor explain 3 core things that will reveal your God-given purpose for value in all your endeavours.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalStudent/72",
    "audios": [
      "https://t.me/TheSupernaturalStudent/71"
    ]
  },
  {
    "text": "Knowing and understanding God's vision for your success is fundamental in matters of excellence. As you behold, you become; What you see is what you seize, all by the power of God.\n\nIn this message, GO FOR IT, you will be hearing the Senior Pastor explain how you can catch a revelation of God's word to you, for your success in all academic pursuits at whatever level.\n\nListen. Share. Invite people to join the telegram channel to be a part of this blessing you are enjoying.",
    "media": "https://t.me/TheSupernaturalStudent/56",
    "audios": [
      "https://t.me/TheSupernaturalStudent/55",
      "https://t.me/TheSupernaturalStudent/37",
      "https://t.me/TheSupernaturalStudent/29"
    ]
  }
]