[
  {
    "text": "The Journey into a Fruitful Marriage\n \nMarriage is God’s covenant institution for building families—the most powerful and influential unit in society. To build this institution to be fruitful, we can not follow society’s standard. We must align with  God’s pattern, just as seen in the relationship between Christ and the Church.\n\nIn this deeply insightful message, “The Journey into a Fruitful Marriage,” Pastor Tara reveals how to prepare for a marriage that flourishes. He walks us through six foundational ways to position ourselves to build lasting, fulfilling and purpose-driven homes.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/134",
    "audios": [
      "https://t.me/TheSupernaturalFamily/135"
    ]
  },
  {
    "text": "**God’s Word: The Key to Life’s Challenges**\n\nIn God’s word, we find the keys that guarantee victory in the face of life’s challenges. To lay hold on these keys, however, we need to wholeheartedly trust the authority and authenticity of the word of God. \n\nIn this message, “God’s word: The Key to Life’s Challenges,” Pastor Tara expounds on the importance of settling the integrity of God’s word on any matter. He also shares three actions to take to ensure effective trust in God’s word. \n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/123",
    "audios": [
      "https://t.me/TheSupernaturalFamily/122"
    ]
  },
  {
    "text": "**MARITAL VICTORIES THROUGH PRAYERS**\n\nGod's plans and purposes for His people are good; and this is true for every area of a believer’s life, including marriage. However, we have a role to play in seeing these plans and purposes manifested. \n\nIn this message, “Marital Victory through Prayers,” Pastor Tara reveals the place of prayer in seeing God’s plans and purposes for us fulfilled. He expounds on reasons we should pray and the benefits available when we engage in prayers. He also emphasises the need to stay in the place of prayer and pray in other tongues to reveal the things we need for victory, thereby causing us to enjoy heaven on earth. \n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/117",
    "audios": [
      "https://t.me/TheSupernaturalFamily/116"
    ]
  },
  {
    "text": "BUILDING HARMONY\n\nEvery home has the potential to be a haven of peace, love, joy and harmony as well as a hub for the fulfillment God's divine purpose on earth. The realisation of this potential, however, does not just happen. It is cultivated through the intentional practice of God's word in the home.\n\nIn this message, 'Building Harmony,' Pastor Tara expounds on how understanding and receiving God's model of submission and leadership in the home is crucial to this haven being built.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/103",
    "audios": [
      "https://t.me/TheSupernaturalFamily/102"
    ]
  },
  {
    "text": "**Financial Prosperity in The Family**\n \nIt is important for a family to understand how God provides so that abundance can be a daily reality in their lives. This abundance is, however, tapped into as we prioritise spending time in God’s word and engaging in spiritual practices like praying, fasting and giving as a family.\n\nIn this message, \"Financial Prosperity in The Family,\" Pastor Tara reveals how these and other spiritual practices bring joint prosperity in the family and how best to engage them.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/88",
    "audios": [
      "https://t.me/TheSupernaturalFamily/86"
    ]
  },
  {
    "text": "**DEALING WITH DESTRUCTIVE LIMITATIONS **\n\nOne encounter with God's word can bring an end to long-standing limitations. Irrespective of the causes of these limitations, the mercy of God is ever present to deliver answers of peace, thereby ensuring progress in all endeavours.\n\nIn this message, “Dealing with Destructive Limitations,\", Pastor Tara Akinkuade highlights the different limitations that can hinder the marital destiny of a man. He further explains how we can deal with them to enjoy a lifting walk with God and successful marriages with our spouses.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/85",
    "audios": [
      "https://t.me/TheSupernaturalFamily/84"
    ]
  },
  {
    "text": "**BREAKING MARITAL DELAY\n\n**Every area of the believer’s life - including his marital life- is intended by God to progress without delays. However, there are times when it appears that his experience is contrary to this design of God. \n\nIn this message, \"Breaking Marital Delay\", Pastor Tara Akinkuade reveals the importance of deciphering our prophetic timing, cooperating with the anointing and guarding our hearts with God’s word in avoiding delays. He also expounds on two things — desire and destructive limitations — that must be addressed to break marital stagnation.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/83",
    "audios": [
      "https://t.me/TheSupernaturalFamily/82"
    ]
  },
  {
    "text": "**Honoring the Institution of God's Word in Marriage**\n\nGod desires that men and women fulfil the mandate to dominate and subdue the earth. Fulfilling this mandate requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage.  \n\nIn this message \"**H**onoring the Institution of God's Word in Marriage,\" Pastor Tara Akinkuade shows us that by upholding mutual honour in our union and letting the peace of God rule in our hearts, we can cultivate a truly functional and harmonious relationship with our spouse.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/81",
    "audios": [
      "https://t.me/TheSupernaturalFamily/80"
    ]
  },
  {
    "text": "**Raising Kids to Reign**\n\nEvery child has a prophetic destiny, from the Lord, to bless their generation. This destiny needs to be safeguarded by parents and guardians if it will be manifested in its full strength. \n\nIn this message, “Raising Kids To Reign”, Pastor Tara Akinkuade teaches us how to consciously raise children whose lives would align with God’s word. He also shows us how to raise them in an environment filled with God’s love.\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/63",
    "audios": [
      "https://t.me/TheSupernaturalFamily/62"
    ]
  },
  {
    "text": "**Understanding and meeting the needs of your Spouse 2\n**\nGod desires that men and women fulfil the mandate to dominate and subdue the earth. Fulfilling this mandate requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage.  \n\nIn the second part of this message 'Understanding and meeting the needs of your Spouse', Pastor Tara Akinkuade underscores the importance of taking responsibility in building  functional relationships as he highlights the woman's role in fulfilling the man's need for admiration and respect, while emphasizing the reciprocal responsibility of men to cherish and love their spouses\n\nDownload. Listen. Share. Be Transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/59",
    "audios": [
      "https://t.me/TheSupernaturalFamily/58"
    ]
  },
  {
    "text": "**Understanding and meeting the needs of your Spouse 1**\n\nGod desires that men and women fulfil the mandate to dominate and subdue the earth. Fulfilling this mandate requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage.  \n\nIn this message, 'Understanding and meeting the needs of your Spouse, Pastor Tara Akinkuade **underscores the importance of taking responsibility in building  functional relationships as he highlights the woman's role in fulfilling the man's need for admiration and respect, while emphasizing the reciprocal responsibility of men to cherish and love their spouses**\n\nDownload. Listen. Share. Be Transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/57",
    "audios": [
      "https://t.me/TheSupernaturalFamily/56"
    ]
  },
  {
    "text": "**Priorities in Marriage**\n\nGod desires that men and women fulfil the mandate to dominate and subdue the earth. Fulfilling this mandate requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage.  \n\nIn this message, **'Priorities in Marriage',** Pastor Tara Akinkuade **reveals work as the vehicle through which man advances God's purpose of dominion on Earth. He also highlights how this equips the man with the necessary skills and abilities to provide for his own needs and the well-being of those under his care, thereby fostering a functional relationship with his spouse.**\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/55",
    "audios": [
      "https://t.me/TheSupernaturalFamily/54"
    ]
  },
  {
    "text": "**Understanding marital responsibilities 2 \n**\nGod desires that men and women fulfill the mandate to dominate and subdue the earth. Fulfilling this mandate requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage.  \n\nIn the second part of this message, '**Understanding marital responsibilities**,' Pastor Tara Akinkuade delves deeper into the roles of the man and woman in marriage. **He unveils the part of the man as a cultivator of his wife and children as well as his own talents and skills. He also underscores the pivotal role of men in emulating the boundless love and glory exemplified by Jesus Christ towards the Church to their wives, and fostering a functional family that glorifies God.**\n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/51",
    "audios": [
      "https://t.me/TheSupernaturalFamily/50"
    ]
  },
  {
    "text": "**The Purpose, Foundation and Priorities of Marriage**\n\nFrom the scriptures, it is clear that marriage is a divine institution established by God. Hence, to understand the purpose and foundation of marriage, we must take our blueprints for marriage from His word.\n\nIn this instructive message, “The Purpose, The Foundation and The Priorities of Marriage”, Pastor Tara Akinkuade reveals to us that the cornerstone of any successful marital union rests upon each spouse having a solid relationship with God. He also expounds on the importance of making divine purpose the basis for any relationship leading to marriage.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/49",
    "audios": [
      "https://t.me/TheSupernaturalFamily/48"
    ]
  },
  {
    "text": "**The Fabric of Family Greatness 2** \n\nFrom the beginning, God desired families to dominate the earth in every sphere. This desire has not changed as God still wants families to dominate and prosper — and the believer's family has an active role to play in making this a reality.\n\nIn this second part of the instructive message, \"The Fabric of Family Greatness,\" the Senior Pastor expounds on four important components of building a great home. He also emphasises how Christ and his principles are the solid foundation for a great marriage.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/45",
    "audios": [
      "https://t.me/TheSupernaturalFamily/44"
    ]
  },
  {
    "text": "The Fabrics of Family Greatness 1\n\nFrom the beginning, God desired families to dominate the earth in every sphere. This desire has not changed as God still wants families to dominate and prosper — and the believer's family has an active role to play in making this a reality.\n\nIn this first part of the instructive message, \"The Fabrics of Family Greatness,\" the Senior Pastor expounds on the importance of the believer’s personal walk with God in building a great Christian home. He explains how every victory the believer experiences personally and every principle from God’s word he embodies filters into the home and affects the trajectory of his children’s lives.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/38",
    "audios": [
      "https://t.me/TheSupernaturalFamily/37"
    ]
  },
  {
    "text": "**Understanding Marital Responsibilities 1**\n\nGod desires that men and women fulfill the mandate to dominate and subdue the earth. Fulfilling this mandate, requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage. \n\nIn this message, **Understanding marital responsibilities,** the Senior Pastor **reveals the roles of the man and the woman in marriage as designed by God. He unveils the right mindsets that we must develop in our hearts about our responsibilities as believers in marriage - and its significance in living a fulfilled life.**\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/33",
    "audios": [
      "https://t.me/TheSupernaturalFamily/32"
    ]
  },
  {
    "text": "**Understanding God's Design and Purpose for Marriage**\n\nGod desires that men and women fulfill the mandate to dominate and subdue the earth. Fulfilling this mandate requires believers to raise godly homes and families that model God’s principles and shape society. In doing this, they have to live out the divine responsibilities God has designed for the man and woman in marriage. \n\nIn this instructive message, **'Understanding God's Design and Purpose for Marriage , the Senior Pastor reveals God’s desire for believers to build homes where His dominion purpose is the foundation, and the couple has a clear understanding of what their individual responsibilities are in the home  - and how they complement each other**.**\n**\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/30",
    "audios": [
      "https://t.me/TheSupernaturalFamily/29"
    ]
  },
  {
    "text": "**Breaking Marital Stagnation **\n\nBelievers today sometimes experience delay with their marital destinies. This delay is often mistaken for God’s process, thereby leading to prolonged results and deferred hopes. \n\nIn this prophetic message, ‘Breaking Marital Stagnation’, the Senior Pastor reveals the reasons for marital delay, and breaks stagnation with mighty utterances. Be liberated, and step into God’s prophetic timing for you as you receive these words. \n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/28",
    "audios": [
      "https://t.me/TheSupernaturalFamily/27"
    ]
  },
  {
    "text": "**MANAGING EXPECTATIONS, THE LOVE WALK AND GENDER ROLES IN MARRIAGE**\n\nA successful marriage is built through the deliberateness of a man and his wife in working through their differences and expectations. However, many believers do not realise this and erroneously believe that success in marriage is automatic. This has led many to doubt God’s heart and desire for marriage especially when they experience challenges.\n\nIn this message, “Managing Expectations, The Love Walk and Gender Roles in Marriage”, the Senior Pastor expounds on the place of intentionality in building a successful marriage. He also sheds light on how the believer can make utmost use of God's word as the manual to build a great marriage.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/23",
    "audios": [
      "https://t.me/TheSupernaturalFamily/22"
    ]
  },
  {
    "text": "**THE POWER OF TWO\n**\nUnity in marriage is central to the strength of a home. When two are united in a home, great progress, prosperity and advancement in life and destiny are imminent.\n\nIn this message, THE POWER OF TWO, The Senior Pastor highlights three pivotal benefits of unity in a godly home.\n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/21",
    "audios": [
      "https://t.me/TheSupernaturalFamily/20"
    ]
  },
  {
    "text": "**TRUST GOD'S WISDOM**\n\nGod’s instructions to us do not always align with natural human wisdom. However, following them guarantees a beautiful life that is decorated with ease, good things and favour with God and man.\n\nIn this powerful message, “Trust God's Wisdom,”the Senior Pastor reveals the benefits of trusting God and His word, particularly as it applies to a marital union.\n \nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/19",
    "audios": [
      "https://t.me/TheSupernaturalFamily/18"
    ]
  },
  {
    "text": "**OVERCOMING STRIFE IN FAMILY**\n\nMarriage is a beautiful union. It is an ordinance and instrument of God for the multiplication and increase of men on earth. Yet, the devil, through strife, has robbed many of the God-ordained joy found in marriage. This has led to the destruction of many good homes as well as potential homes.\n\nIn this enlightening message, Overcoming Strife in Family, the Senior Pastor reveals how the devil operates to introduce strife into the family. Through Godly wisdom and prophetic instructions, he unveils how believers can overcome strife to enjoy the beautiful union God has ordained for them. \n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/11",
    "audios": [
      "https://t.me/TheSupernaturalFamily/10"
    ]
  },
  {
    "text": "**SPIRITUALITY: THE BEDROCK OF A BEAUTIFUL UNION 2**\n\nGod's word is the bedrock of any successful marriage. In it, we see powerful principles put together to make the believer’s life, and consequently his marriage, beautiful. \n\nIn this revelational message, ‘Spirituality: The Bedrock of a Beautiful Union’, the Senior Pastor reveals the principles of God’s word that strengthen our christian walk and our marriages. \n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/9",
    "audios": [
      "https://t.me/TheSupernaturalFamily/8"
    ]
  },
  {
    "text": "**SPIRITUALITY: THE BEDROCK OF A BEAUTIFUL UNION**\n\nGod's word is the bedrock of any successful marriage. In it, we see powerful principles put together to make the believer’s life, and consequently his marriage, beautiful. \n\nIn this revelational message, ‘Spirituality: The Bedrock of a Beautiful Union’, the Senior Pastor reveals the principles of God’s word that strengthen our christian walk and our marriages. \n\nListen. Share. Be transformed. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/7",
    "audios": [
      "https://t.me/TheSupernaturalFamily/5"
    ]
  },
  {
    "text": "**ENJOYING MARRIAGE**\n\nThe sacrifice of Jesus has qualified the believer for a beautiful life. This beauty and glory also extends to his marital life, as a result of which, he can expect to enjoy a beautiful and fruitful union.  \n\nIn this recent message, 'Enjoying Marriage', the Senior Pastor reveals spiritual principles for enjoying a glorious marital union. Through the relationship between Christ and the Church, he unveils how husbands and wives can live in peace and joy with one another.  \n\nListen. Share. Invite people to join this Telegram channel to be a part of this blessing you are enjoying.\n\nGod bless you.",
    "media": "https://t.me/TheSupernaturalFamily/4",
    "audios": [
      "https://t.me/TheSupernaturalFamily/3"
    ]
  }
]